glocklueng/032/LayerOne_2014/badge/code/stm32-prox/armsrc/fpgaloader.c
#if 0

//-----------------------------------------------------------------------------
// Routines to load the FPGA image, and then to configure the FPGA's major
// mode once it is configured.
//
// Jonathan Westhues, April 2006
//-----------------------------------------------------------------------------
#include <proxmark3.h>
#include "apps.h"

//-----------------------------------------------------------------------------
// Set up the synchronous serial port, with the one set of options that we
// always use when we are talking to the FPGA. Both RX and TX are enabled.
//-----------------------------------------------------------------------------
void FpgaSetupSsc ( void )
{
	// First configure the GPIOs, and get ourselves a clock.
	AT91C_BASE_PIOA->PIO_ASR =
	    GPIO_SSC_FRAME  |
	    GPIO_SSC_DIN    |
	    GPIO_SSC_DOUT   |
	    GPIO_SSC_CLK;
	AT91C_BASE_PIOA->PIO_PDR = GPIO_SSC_DOUT;

	AT91C_BASE_PMC->PMC_PCER = ( 1 << AT91C_ID_SSC );

	// Now set up the SSC proper, starting from a known state.
	AT91C_BASE_SSC->SSC_CR = AT91C_SSC_SWRST;

	// RX clock comes from TX clock, RX starts when TX starts, data changes
	// on RX clock rising edge, sampled on falling edge
	AT91C_BASE_SSC->SSC_RCMR = SSC_CLOCK_MODE_SELECT ( 1 ) | SSC_CLOCK_MODE_START ( 1 );

	// 8 bits per transfer, no loopback, MSB first, 1 transfer per sync
	// pulse, no output sync, start on positive-going edge of sync
	AT91C_BASE_SSC->SSC_RFMR = SSC_FRAME_MODE_BITS_IN_WORD ( 8 ) |
	                           AT91C_SSC_MSBF | SSC_FRAME_MODE_WORDS_PER_TRANSFER ( 0 );

	// clock comes from TK pin, no clock output, outputs change on falling
	// edge of TK, start on rising edge of TF
	AT91C_BASE_SSC->SSC_TCMR = SSC_CLOCK_MODE_SELECT ( 2 ) |
	                           SSC_CLOCK_MODE_START ( 5 );

	// tx framing is the same as the rx framing
	AT91C_BASE_SSC->SSC_TFMR = AT91C_BASE_SSC->SSC_RFMR;

	AT91C_BASE_SSC->SSC_CR = AT91C_SSC_RXEN | AT91C_SSC_TXEN;
}

//-----------------------------------------------------------------------------
// Set up DMA to receive samples from the FPGA. We will use the PDC, with
// a single buffer as a circular buffer (so that we just chain back to
// ourselves, not to another buffer). The stuff to manipulate those buffers
// is in apps.h, because it should be inlined, for speed.
//-----------------------------------------------------------------------------
void FpgaSetupSscDma ( BYTE *buf, int len )
{
	// charlie
	//AT91C_BASE_PDC_SSC->PDC_PTCR = AT91C_PDC_RXTDIS; // disable Rx DMA

	AT91C_BASE_PDC_SSC->PDC_RPR = ( uint32_t ) buf;
	AT91C_BASE_PDC_SSC->PDC_RCR = len;

	// next buffer pointer
	AT91C_BASE_PDC_SSC->PDC_RNPR = ( uint32_t ) buf;
	AT91C_BASE_PDC_SSC->PDC_RNCR = len;

	// enable rx transfer
	AT91C_BASE_PDC_SSC->PDC_PTCR = AT91C_PDC_RXTEN | AT91C_PDC_TXTDIS;
}

static void DownloadFPGA_byte ( unsigned char w )
{
#define SEND_BIT(x) { if(w & (1<<x) ) HIGH(GPIO_FPGA_DIN); else LOW(GPIO_FPGA_DIN); HIGH(GPIO_FPGA_CCLK); LOW(GPIO_FPGA_CCLK); }
	SEND_BIT ( 7 );
	SEND_BIT ( 6 );
	SEND_BIT ( 5 );
	SEND_BIT ( 4 );
	SEND_BIT ( 3 );
	SEND_BIT ( 2 );
	SEND_BIT ( 1 );
	SEND_BIT ( 0 );
}

// Download the fpga image starting at FpgaImage and with length FpgaImageLen bytes
// If bytereversal is set: reverse the byte order in each 4-byte word
static void DownloadFPGA ( const char *FpgaImage, int FpgaImageLen, int bytereversal )
{
	int i=0;

	HIGH ( NVDD_ON );               // ensure everything is powered on

	SpinDelay ( 50 );

	LED_D_ON();

	// These pins are inputs
	AT91C_BASE_PIOA->PIO_ODR =
	    GPIO_FPGA_NINIT |
	    GPIO_FPGA_DONE;
	// PIO controls the following pins
	AT91C_BASE_PIOA->PIO_PER =
	    GPIO_FPGA_NINIT |
	    GPIO_FPGA_DONE;
	// Enable pull-ups
	AT91C_BASE_PIOA->PIO_PPUER =
	    GPIO_FPGA_NINIT |
	    GPIO_FPGA_DONE;

	// setup initial logic state
	HIGH ( GPIO_FPGA_NPROGRAM );
	LOW ( GPIO_FPGA_CCLK );
	LOW ( GPIO_FPGA_DIN );
	// These pins are outputs
	AT91C_BASE_PIOA->PIO_OER =
	    GPIO_FPGA_NPROGRAM  |
	    GPIO_FPGA_CCLK      |
	    GPIO_FPGA_DIN;

	// enter FPGA configuration mode
	LOW ( GPIO_FPGA_NPROGRAM );
	SpinDelay ( 50 );
	HIGH ( GPIO_FPGA_NPROGRAM );

	i=100000;

	// wait for FPGA ready to accept data signal
	while ( ( i ) && ( ! ( AT91C_BASE_PIOA->PIO_PDSR & GPIO_FPGA_NINIT ) ) ) {
		i--;
	}

	// crude error indicator, leave both red LEDs on and return
	if ( i==0 ) {
		LED_C_ON();
		LED_D_ON();
		return;
	}

	if ( bytereversal ) {
		/* This is only supported for DWORD aligned images */
		if ( ( ( int ) FpgaImage % sizeof ( DWORD ) ) == 0 ) {
			i=0;

			while ( FpgaImageLen-->0 ) {
				DownloadFPGA_byte ( FpgaImage[ ( i++ ) ^0x3] );
			}

			/* Explanation of the magic in the above line:
			 * i^0x3 inverts the lower two bits of the integer i, counting backwards
			 * for each 4 byte increment. The generated sequence of (i++)^3 is
			 * 3 2 1 0 7 6 5 4 11 10 9 8 15 14 13 12 etc. pp.
			 */
		}
	}

	else {
		while ( FpgaImageLen-->0 ) {
			DownloadFPGA_byte ( *FpgaImage++ );
		}
	}

	// continue to clock FPGA until ready signal goes high
	i=100000;

	while ( ( i-- ) && ( ! ( AT91C_BASE_PIOA->PIO_PDSR & GPIO_FPGA_DONE ) ) ) {
		HIGH ( GPIO_FPGA_CCLK );
		LOW ( GPIO_FPGA_CCLK );
	}

	// crude error indicator, leave both red LEDs on and return
	if ( i==0 ) {
		LED_C_ON();
		LED_D_ON();
		return;
	}

	LED_D_OFF();
}

static char *bitparse_headers_start;
static char *bitparse_bitstream_end;
static int bitparse_initialized;
/* Simple Xilinx .bit parser. The file starts with the fixed opaque byte sequence
 * 00 09 0f f0 0f f0 0f f0 0f f0 00 00 01
 * After that the format is 1 byte section type (ASCII character), 2 byte length
 * (big endian), <length> bytes content. Except for section 'e' which has 4 bytes
 * length.
 */
static const char _bitparse_fixed_header[] = {0x00, 0x09, 0x0f, 0xf0, 0x0f, 0xf0, 0x0f, 0xf0, 0x0f, 0xf0, 0x00, 0x00, 0x01};
static int bitparse_init ( void * start_address, void *end_address )
{
	bitparse_initialized = 0;

