glocklueng/032/LayerOne_2014/badge/code/stm32-prox/armsrc/fpgaloader.c
	SPI_InitTypeDef  SPI_InitStructure;

	if ( on_off ) {
		/*-----------------ARKO'S TEST CODE - SPI SLAVE-----------------------------*/
		// Start SPI Slave
		RCC_APB2PeriphClockCmd ( RCC_APB2Periph_GPIOB, ENABLE );

		/* Enable SPI2 Periph clock */
		RCC_APB1PeriphClockCmd ( RCC_APB1Periph_SPI2, ENABLE );

		GPIO_InitTypeDef GPIO_InitStructure;
		/* Configure SPIz pins: SCK, MISO and MOSI */
		//GPIO_InitStructure.GPIO_Pin = SSP_FRAME_PIN | SSP_DIN_PIN |SSP_DOUT_PIN | SSP_CLK_PIN;
		//GPIO_Init(GPIOB, &GPIO_InitStructure);

		SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Rx;
		SPI_InitStructure.SPI_Mode = SPI_Mode_Slave;
		SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b;
		SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;   // high
		SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;  // 1edge // Sample on clock falling edge
		SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
		SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
		SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
		SPI_InitStructure.SPI_CRCPolynomial = 15;
		SPI_Init ( SPI2, &SPI_InitStructure );
		
		/* Enable SPIz */
		SPI_Cmd ( SPI2, ENABLE );
	}

	NVIC_InitTypeDef   NVIC_InitStructure;

	/* Enable and set EXTIn Interrupt to the lowest priority */
	NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 4;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 4;

	if ( on_off == 1 ) {
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	}

	else {
		NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
	}

	NVIC_Init ( &NVIC_InitStructure );

	return;

	NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;

	if ( on_off == 1 ) {
		NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
	}

	else {
		NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
	}

	NVIC_Init ( &NVIC_InitStructure );


}


// DMA buffer

uint8_t fpga_dma_buffer[];
#if 0
	uint16_t TxIdx = 0;
	uint16_t RxIdx = 0;
	uint16_t SPIz_Buffer_Tx[BufferSize] = {0xFFFF};

	static uint16_t SPIy_Buffer_Rx[BufferSize], SPIz_Buffer_Rx[BufferSize];

	while ( GETBIT ( SSP_FRAME  ) == 0 );

	/* Transfer procedure */
	while ( RxIdx < BufferSize ) {
		/* Wait for SPIz data reception */
		while ( SPI_I2S_GetFlagStatus ( SPI2, SPI_I2S_FLAG_RXNE ) == RESET );

		/* Read SPIz received data */
		SPIz_Buffer_Rx[RxIdx] = SPI_I2S_ReceiveData ( SPI2 );
		RxIdx++;
	}

	/*-------------- END ARKO'S TEST CODE - SPI SLAVE---------------------------*/

#endif
